[
    {
        "id": "1",
        "word": "Abdicate",
        "phrase": "To give up a throne voluntarily",
        "usage": "The king decided to abdicate in favor of his son."
    },
    {
        "id": "2",
        "word": "Altruist",
        "phrase": "A person who is concerned with the welfare of others",
        "usage": "She was known as an altruist, always putting others before herself."
    },
    {
        "id": "3",
        "word": "Bibliophile",
        "phrase": "A person who loves or collects books",
        "usage": "Being a bibliophile, he spent most of his weekends at the local library."
    },
    {
        "id": "4",
        "word": "Connoisseur",
        "phrase": "An expert judge in matters of taste",
        "usage": "She was a connoisseur of fine wines and always selected the best vintages."
    },
    {
        "id": "5",
        "word": "Demagogue",
        "phrase": "A political leader who seeks support by appealing to popular desires and prejudices",
        "usage": "The politician was accused of being a demagogue, manipulating emotions instead of using facts."
    },
    {
        "id": "6",
        "word": "Ephemeral",
        "phrase": "Lasting for a very short time",
        "usage": "Her fame was ephemeral, lasting only a few months."
    },
    {
        "id": "7",
        "word": "Filibuster",
        "phrase": "An action obstructing progress in a legislative assembly without breaking procedures",
        "usage": "He launched a filibuster to delay the passing of the bill."
    },
    {
        "id": "8",
        "word": "Glutton",
        "phrase": "An excessively greedy eater",
        "usage": "Despite being a glutton, he managed to stay fit through regular exercise."
    },
    {
        "id": "9",
        "word": "Hedonist",
        "phrase": "A person who believes the pursuit of pleasure is the most important thing",
        "usage": "As a hedonist, he spent much of his time seeking new experiences and pleasures."
    },
    {
        "id": "10",
        "word": "Introvert",
        "phrase": "A person predominantly concerned with their own thoughts and feelings",
        "usage": "Being an introvert, she preferred spending quiet evenings at home."
    },
    {
        "id": "11",
        "word": "Jingoism",
        "phrase": "Extreme patriotism, especially in aggressive foreign policy",
        "usage": "The speech was filled with jingoism, calling for aggressive action against other countries."
    },
    {
        "id": "12",
        "word": "Kleptomaniac",
        "phrase": "A person with a compulsive desire to steal",
        "usage": "He was diagnosed as a kleptomaniac, unable to resist the urge to steal small items."
    },
    {
        "id": "13",
        "word": "Luddite",
        "phrase": "A person opposed to increased industrialization or technology",
        "usage": "As a Luddite, she refused to buy a smartphone and used an old flip phone instead."
    },
    {
        "id": "14",
        "word": "Misogynist",
        "phrase": "A person who dislikes, despises, or is prejudiced against women",
        "usage": "His misogynist views were apparent in his dismissive comments about women."
    },
    {
        "id": "15",
        "word": "Narcissist",
        "phrase": "A person who has an excessive interest in or admiration of themselves",
        "usage": "He was such a narcissist, constantly admiring his reflection in every mirror."
    },
    {
        "id": "16",
        "word": "Omnivore",
        "phrase": "An animal or person that eats both plants and animals",
        "usage": "Humans are generally omnivores, able to eat both plants and meat."
    },
    {
        "id": "17",
        "word": "Philanthropist",
        "phrase": "A person who seeks to promote the welfare of others",
        "usage": "The philanthropist donated millions to help improve education in impoverished areas."
    },
    {
        "id": "18",
        "word": "Quintessential",
        "phrase": "Representing the most typical example of a quality or class",
        "usage": "Her elegant style was quintessential of the high society."
    },
    {
        "id": "19",
        "word": "Raconteur",
        "phrase": "A person who tells anecdotes in a skillful and amusing way",
        "usage": "As a raconteur, he kept the audience engaged with his storytelling."
    },
    {
        "id": "20",
        "word": "Sycophant",
        "phrase": "A person who acts obsequiously toward someone important to gain advantage",
        "usage": "He was known as a sycophant, always trying to flatter his boss for promotion."
    },
    {
        "id": "21",
        "word": "Teetotaler",
        "phrase": "A person who never drinks alcohol",
        "usage": "As a teetotaler, she always opted for water at social gatherings."
    },
    {
        "id": "22",
        "word": "Utilitarian",
        "phrase": "One who believes in maximizing utility for the greatest number of people",
        "usage": "The utilitarian approach focuses on achieving the greatest good for the majority."
    },
    {
        "id": "23",
        "word": "Voracious",
        "phrase": "Wanting or devouring great quantities of food; eager in activities",
        "usage": "He was a voracious reader, finishing a book every week."
    },
    {
        "id": "24",
        "word": "Wanderlust",
        "phrase": "A strong desire to travel",
        "usage": "Her wanderlust led her to visit over thirty countries in her lifetime."
    },
    {
        "id": "25",
        "word": "Xenophile",
        "phrase": "An individual attracted to foreign cultures or customs",
        "usage": "A xenophile, he loved exploring different cultures and making friends abroad."
    },
    {
        "id": "26",
        "word": "Yokel",
        "phrase": "An uneducated and unsophisticated person from the countryside",
        "usage": "Despite being a yokel, he quickly adapted to city life."
    },
    {
        "id": "27",
        "word": "Zealot",
        "phrase": "A person who is fanatical and uncompromising in pursuit of ideals",
        "usage": "He was a zealot for environmental conservation, willing to go to any lengths to protect nature."
    },
    {
        "id": "28",
        "word": "Agnostic",
        "phrase": "One who is not sure about God's existence",
        "usage": "He identified as an agnostic, questioning but not denying a higher power."
    },
    {
        "id": "29",
        "word": "Arsonist",
        "phrase": "A person who deliberately sets fire to a building",
        "usage": "The fire was determined to be the act of an arsonist."
    },
    {
        "id": "30",
        "word": "Amateur",
        "phrase": "One who does a thing for pleasure and not as a profession",
        "usage": "Though he was an amateur, his talent was undeniable."
    },
    {
        "id": "31",
        "word": "Ambidextrous",
        "phrase": "One who can use either hand with ease",
        "usage": "Her ambidextrous skills impressed everyone in the class."
    },
    {
        "id": "32",
        "word": "Auditor",
        "phrase": "One who makes an official examination of accounts",
        "usage": "The auditor found discrepancies in the accounts."
    },
    {
        "id": "33",
        "word": "Anarchist",
        "phrase": "A person who believes in or tries to bring about a state of lawlessness",
        "usage": "As an anarchist, he opposed all forms of structured government."
    },
    {
        "id": "34",
        "word": "Apostate",
        "phrase": "A person who has changed his faith",
        "usage": "He was labeled an apostate after leaving his former faith."
    },
    {
        "id": "35",
        "word": "Atheist",
        "phrase": "One who does not believe in the existence of God",
        "usage": "Her firm beliefs aligned with those of an atheist."
    },
    {
        "id": "36",
        "word": "Arbitrator",
        "phrase": "A person appointed by two parties to solve a dispute",
        "usage": "The arbitrator was called to resolve the conflict."
    },
    {
        "id": "37",
        "word": "Ascetic",
        "phrase": "One who leads a life of self-denial and contemplation",
        "usage": "He adopted an ascetic lifestyle, abstaining from all material pleasures."
    },
    {
        "id": "38",
        "word": "Constellation",
        "phrase": "A series of stars",
        "usage": "The constellation Orion is visible in winter."
    },
    {
        "id": "39",
        "word": "Cortege",
        "phrase": "A funeral procession",
        "usage": "The cortege made its way slowly through town."
    },
    {
        "id": "40",
        "word": "Congregation",
        "phrase": "A group of worshippers",
        "usage": "The congregation gathered at the church every Sunday."
    },
    {
        "id": "41",
        "word": "Drove",
        "phrase": "A herd or flock of animals being driven in a body",
        "usage": "The drove of sheep moved across the field."
    },
    {
        "id": "42",
        "word": "Democracy",
        "phrase": "A system of government by the whole population or all eligible members",
        "usage": "In a democracy, citizens have the right to vote."
    },
    {
        "id": "43",
        "word": "Debonair",
        "phrase": "A person having a sophisticated charm",
        "usage": "He entered the room with a debonair smile, charming everyone instantly."
    },
    {
        "id": "44",
        "word": "Dilettante",
        "phrase": "A dabbler in art, science, and literature (not serious)",
        "usage": "She was a dilettante in many fields but never pursued one deeply."
    },
    {
        "id": "45",
        "word": "Epicure",
        "phrase": "One who enjoys the pleasures of eating and drinking",
        "usage": "He was an epicure, always seeking the finest dining experiences."
    },
    {
        "id": "46",
        "word": "Egotist",
        "phrase": "One who often talks of his achievements",
        "usage": "The egotist could not stop bragging about his accomplishments."
    },
    {
        "id": "47",
        "word": "Emigrant",
        "phrase": "Someone who leaves one country to settle in another",
        "usage": "The emigrant family started a new life in another country."
    },
    {
        "id": "48",
        "word": "Effeminate",
        "phrase": "A man who is womanish in his habits",
        "usage": "He was often described as effeminate due to his graceful mannerisms."
    },
    {
        "id": "49",
        "word": "Fastidious",
        "phrase": "One who is hard to please and very selective in habits",
        "usage": "She was fastidious about her choices, accepting only the best."
    },
    {
        "id": "50",
        "word": "Fugitive",
        "phrase": "One who runs away from justice",
        "usage": "The fugitive was on the run for years before being captured."
    },
    {
        "id": "51",
        "word": "Fanatic",
        "phrase": "One filled with excessive enthusiasm in religious matters",
        "usage": "The fanatic could not accept any views but his own."
    },
    {
        "id": "52",
        "word": "Fatalist",
        "phrase": "One who believes in fate",
        "usage": "As a fatalist, she believed everything was preordained."
    },
    {
        "id": "53",
        "word": "Flotilla",
        "phrase": "A small fleet of ships or boats",
        "usage": "A flotilla of boats lined up for the regatta."
    },
    {
        "id": "54",
        "word": "Grove",
        "phrase": "A small growth of trees without underbrush",
        "usage": "The grove offered a cool, shaded place to relax."
    },
    {
        "id": "55",
        "word": "Gerontocracy",
        "phrase": "A state, society, or group governed by old people",
        "usage": "The gerontocracy was out of touch with the youth."
    },
    {
        "id": "56",
        "word": "Gourmand",
        "phrase": "A lover of good food",
        "usage": "As a gourmand, he was always searching for delicious cuisine."
    },
    {
        "id": "57",
        "word": "Honorary",
        "phrase": "Conferred as an honor",
        "usage": "She received an honorary degree from the university."
    },
    {
        "id": "58",
        "word": "Heretic",
        "phrase": "A person who acts against religion",
        "usage": "The heretic was shunned for his unconventional beliefs."
    },
    {
        "id": "59",
        "word": "Highbrow",
        "phrase": "A person of intellectual or erudite tastes",
        "usage": "He was a highbrow, enjoying art galleries and classical music."
    },
    {
        "id": "60",
        "word": "Hypochondriac",
        "phrase": "A patient with imaginary symptoms and ailments",
        "usage": "The hypochondriac constantly worried about new ailments."
    },
    {
        "id": "53",
        "word": "Flotilla",
        "phrase": "A small fleet of ships or boats",
        "usage": "A flotilla of boats lined up for the regatta."
    },
    {
        "id": "54",
        "word": "Grove",
        "phrase": "A small growth of trees without underbrush",
        "usage": "The grove offered a cool, shaded place to relax."
    },
    {
        "id": "55",
        "word": "Gerontocracy",
        "phrase": "A state, society, or group governed by old people",
        "usage": "The gerontocracy was out of touch with the youth."
    },
    {
        "id": "56",
        "word": "Gourmand",
        "phrase": "A lover of good food",
        "usage": "As a gourmand, he was always searching for delicious cuisine."
    },
    {
        "id": "57",
        "word": "Honorary",
        "phrase": "Conferred as an honor",
        "usage": "She received an honorary degree from the university."
    },
    {
        "id": "58",
        "word": "Heretic",
        "phrase": "A person who acts against religion",
        "usage": "The heretic was shunned for his unconventional beliefs."
    },
    {
        "id": "59",
        "word": "Highbrow",
        "phrase": "A person of intellectual or erudite tastes",
        "usage": "He was a highbrow, enjoying art galleries and classical music."
    },
    {
        "id": "60",
        "word": "Hypochondriac",
        "phrase": "A patient with imaginary symptoms and ailments",
        "usage": "The hypochondriac constantly worried about new ailments."
    },
    {
        "id": "61",
        "word": "Henpecked",
        "phrase": "A person who is controlled by his wife",
        "usage": "He was often teased for being henpecked."
    },
    {
        "id": "62",
        "word": "Hamlet",
        "phrase": "A community of people smaller than a village",
        "usage": "They lived in a small hamlet far from any major city."
    },
    {
        "id": "63",
        "word": "Horde",
        "phrase": "A large group of people",
        "usage": "A horde of fans gathered outside the stadium."
    },
    {
        "id": "64",
        "word": "Indefatigable",
        "phrase": "One with sustained enthusiastic action and unflagging vitality",
        "usage": "Her indefatigable spirit kept the team motivated."
    },
    {
        "id": "65",
        "word": "Iconoclast",
        "phrase": "Someone who attacks cherished ideas or traditional institutions",
        "usage": "The iconoclast challenged all the established beliefs."
    },
    {
        "id": "66",
        "word": "Immoral",
        "phrase": "One who behaves without moral principles",
        "usage": "His immoral actions shocked the community."
    },
    {
        "id": "67",
        "word": "Impregnable",
        "phrase": "A person who is incapable of being tampered with",
        "usage": "The fortress was considered impregnable."
    },
    {
        "id": "68",
        "word": "Insolvent",
        "phrase": "One unable to pay his debts",
        "usage": "He declared himself insolvent after the business failed."
    },
    {
        "id": "69",
        "word": "Kakistocracy",
        "phrase": "A state run by the worst, least qualified, or most unscrupulous citizens",
        "usage": "The people felt trapped in a kakistocracy."
    },
    {
        "id": "70",
        "word": "Lunatic",
        "phrase": "A person who is mentally ill",
        "usage": "In earlier times, a lunatic was often shunned by society."
    },
    {
        "id": "71",
        "word": "Monarchy",
        "phrase": "A form of government with a monarch at the head",
        "usage": "The country had been a monarchy for centuries."
    },
    {
        "id": "72",
        "word": "Misanthrope",
        "phrase": "A person who dislikes humankind and avoids human society",
        "usage": "The misanthrope preferred the company of books to people."
    },
    {
        "id": "73",
        "word": "Mercenary",
        "phrase": "A person primarily concerned with making money at the expense of ethics",
        "usage": "He was seen as a mercenary, caring only for profit."
    },
    {
        "id": "74",
        "word": "Omnipotent",
        "phrase": "Someone who is all-powerful",
        "usage": "The deity was considered omnipotent in their beliefs."
    },
    {
        "id": "75",
        "word": "Optometrist",
        "phrase": "A person whose job is to examine people's eyes",
        "usage": "The optometrist recommended new lenses for better vision."
    },
    {
        "id": "76",
        "word": "Pessimist",
        "phrase": "One who sees only the negative side of things",
        "usage": "The pessimist could find a downside to any good news."
    },
    {
        "id": "77",
        "word": "Polygamist",
        "phrase": "A person who has more than one spouse at the same time",
        "usage": "Polygamy was practiced in certain societies."
    },
    {
        "id": "78",
        "word": "Omniscient",
        "phrase": "Having complete or unlimited knowledge",
        "usage": "The omniscient narrator knew everything about each character's thoughts and feelings."
    }  
]
